//node groups
"Constants" = "定数";
"Filter" = "フィルター";
"Math" = "関数";
"Other" = "その他";
"Shader" = "シェーダー";
"Textures" = "テクスチャマップ";

//node types
"color" = "カラー";
"number" = "定数";
"vector" = "ベクトル";
"composite" = "合成";
"gradient" = "グラデーション";
"hsv2rgb" = "HSV→RGB";
"rgb2hsv" = "RGB→HSV";
"abs" = "絶対値";
"add" = "加算";
"cosine" = "コサイン";
"crossprod" = "クロス積";
"divide" = "除算";
"dotprod" = "ドット積";
"float2vec" = "フロート→ベクトル";
"mix" = "ミックス";
"modulo" = "剰余";
"multiply" = "乗算";
"multiplyadd" = "乗加算";
"norm" = "ノーマライズ";
"power" = "累乗";
"pulse" = "パルス";
"pulsetrain" = "矩形波";
"sine" = "サイン";
"squareroot" = "平方根";
"step" = "ステップ";
"subtract" = "減算";
"tangent" = "タンジェント";
"vec2float" = "ベクトル→フロート";
"carpaint" = "カーペイント";
"dielectric" = "誘電体";
"material" = "マテリアル";
"membrane" = "膜";
"metal" = "メタル";
"shadow" = "影";
"solid" = "ソリッド";
"toon" = "トゥーン";
"velvet" = "ベルベット";
"state" = "状態";
"instancestate" = "インスタンス";
"brick" = "煉瓦";
"cellnoise" = "セルノイズ";
"checkerboard" = "チェッカーボード";
"directional" = "ディレクショナル";
"dots" = "ドット";
"fractal" = "フラクタル";
"image" = "イメージ";
"marble" = "大理石";
"noise" = "ノイズ";
"reptile" = "うろこ状";
"turbulence" = "乱流";
"voronoi" = "ボロノイ";
"wireframe" = "ワイヤフレーム";
"wood" = "木目";


//shader channels
"diffColor" = "ディフューズ";
"emisColor" = "エミッシブ";
"emisIntensity" = "強さ";
"specColor" = "スペキュラー";
"specSize" = "スペキュラーサイズ";
"specSheen" = "光沢";
"specBackscatter" = "バックスキャッター";
"specEdgeiness" = "鋭さ";
"specRoughness" = "ラフネス";
"bumpmap" = "バンプマップ";
"reflColor" = "反射";
"reflEta" = "ETA";
"reflCEta" = "吸光";
"reflRoughness" = "ラフネス";
"reflAnisotropy" = "異方性反射";
"reflType" = "反射タイプ";
"reflBlur" = "反射ブラー";
"reflSamples" = "サンプル数";
"reflFresnel" = "フレネル";
"reflMin" = "最小値";
"reflPow" = "パワー";
"transColor" = "透明度";
"transEta" = "IOR";
"transUseAlpha" = "アルファチャンネル使用";
"transFresnel" = "フレネル";
"transPow" = "強さ";
"transMin" = "しきい値";
"transBlur" = "透過ブラー";
"transSamples" = "サンプル数";
"absColor" = "吸収";
"absDensity" = "密度";
"bumpType" = "マップタイプ";
"bumpHeight" = "ハイトマップ";
"bumpNormal" = "ノーマルマップ";
"bump" = "バンプマップ";

//other node channels
"color" = "カラー";
"val" = "値";
"vec" = "ベクトル";

"rgba" = "RGBA";
"intensity" = "強さ";
"number" = "定数";
"vector" = "ベクトル";

"position" = "位置";
"scale" = "拡大縮小";
"normal" = "法線";
"eye" = "視点ベクトル";
"uv1" = "UV1";
"uv2" = "UV2";
"i·n" = "I·N";
"time" = "時間";
"sample" = "サンプル";

"direction" = "方向";
"rand" = "ランダム";
"uvw" = "UVW";
"age" = "生存時間";

"gradient" = "グラデーション";
"hsv" = "HSV";
"rgb" = "RGB";

"t" = "t";
"a" = "A";
"b" = "B";
"x" = "X";
"y" = "Y";
"z" = "Z";
"w" = "W";
"amplitude" = "振幅";
"offset" = "オフセット";
"frequency" = "周期";
"denominator" = "除数";
"exponent" = "指数";
"edge1" = "エッジ 1";
"edge2" = "エッジ 2";
"smooth" = "スムース";
"period" = "周期";
"edge" = "エッジ";

"color0" = "カラー 0";
"color1" = "カラー 1";
"width" = "幅";
"height" = "高さ";
"depth" = "奥行き";
"mortar" = "モルタル";
"colorX" = "X 軸カラー";
"colorY" = "Y 軸カラー";
"colorZ" = "Z 軸カラー";
"dotsize" = "ドットサイズ";
"dottype" = "ドットタイプ";
"dotpattern" = "ドットパターン";
"regular" = "レギュラー";
"packed" = "パック";
"step" = "ステップ";
"linear" = "リニア";
"round" = "円形";
"mixcolor" = "混合色";
"mix" = "ミックス";
"intensity" = "強さ";
"tileU" = "タイル U 方向";
"tileV" = "タイル V 方向";
"filtertype" = "フィルタ";
"closest" = "オフ";
"bilinear" = "バイリニア";
"trilinear" = "トリリニア";
"anisotropic" = "異方向性";
"background" = "背景";
"octaves" = "オクターブ";
"lacunarity" = "空隙性";
"gain" = "ゲイン";
"radius" = "半径";
"type" = "タイプ";
"const" = "定数";
"f1" = "F1";
"f2" = "F2";
"f2-f1" = "F2-F1";
"linewidth" = "線の太さ";
"linetype" = "線タイプ";
"linedraw" = "描画";
"ringy" = "環状模様";
"ringfreq" = "環状頻度";
"ringnoise" = "ノイズ";
"ringnoisefreq" = "ノイズ頻度";
"grainy" = "粒状模様";
"grainfreq" = "粒状頻度";
"trunkwobble" = "幹の模様";
"trunkwobblefreq" = "幹の頻度";
"angularwobble" = "角の模様";
"angularwobblefreq" = "角模様の頻度";
"whitePoint" = "ホワイトポイント";
"texture" = "テクスチャ";
"Textures" = "テクスチャマップ";
"Disconnect" = "接続解除";


//Other
"Sample" = "サンプル";
"Number" = "数";
"Vector" = "ベクトル";
"Color" = "カラー";
"Gradient" = "グラデーション";
"Diffuse" = "ディフューズ";
"Specular" = "スペキュラー";
"Emissiv" = "エミッシブ";
"Absorption" = "吸収";
"Reflection" = "リフレクション";
"Refraction" = "トランスパレンシー";
"Bumpmapping" = "バンプマップ";
"Turbulence" = "乱流";
"Marble" = "大理石";
"Wood" = "木目";
"Rings" = "環状模様";
"Grain" = "粒状模様";
"Trunkwobble" = "幹の模様";
"Angularwobble" = "角の模様";